src/DataProcessors/СогласованиеЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>СогласованиеЗаявок</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ЗаявкаСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЗаявкаСтатусы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЗаявкаСтроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЗаявкаСтроки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перечень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЗаявкаЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЗаявкаЦены</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЗаявкаСогласованаЦена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЗаявкаСогласованаЦена</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЗаявкаОтмененные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЗаявкаОтмененные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/СтатусыЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>СтатусыЗаявки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформление</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предыдущий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предыдущий1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предыдущий2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предыдущий3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Следующий3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Видимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доступность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КадровыеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/СогласованиеЗаявок/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КомандаНачатьОбработкуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КомандаНачатьОбработкуНаСервере(ТолькоЗаполнитьДляСогласования=Истина)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаявкаСтроки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗаявкаСтроки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ЗаявкаЦены.Количество, ЗаявкаСтроки.Количество) КАК Количество,
	|	ЗаявкаСтроки.ОсновноеСредство КАК ОсновноеСредство,
	|	ЗаявкаСтроки.НомерЗаявки КАК НомерЗаявки,
	|	ЕСТЬNULL(ЗаявкаЦены.Цена, ""-"") КАК Цена,
	|	ЕСТЬNULL(ЗаявкаЦены.Цена * ЕСТЬNULL(ЗаявкаЦены.Количество, ЗаявкаСтроки.Количество), ""-"") КАК Сумма,
	|	&Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ЗаявкаСтатусы.СрезПоследних КАК ЗаявкаСтатусы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкаСтроки КАК ЗаявкаСтроки
	|		ПО ЗаявкаСтатусы.ИдентификаторСтроки = ЗаявкаСтроки.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкаЦены.СрезПоследних КАК ЗаявкаЦены
	|		ПО ЗаявкаСтатусы.ИдентификаторСтроки = ЗаявкаЦены.ИдентификаторСтроки
	|ГДЕ
	|	ЗаявкаСтатусы.Статус.Согласование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаСтроки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗаявкаСтроки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ЗаявкаЦены.Количество, ЗаявкаСтроки.Количество) КАК Количество,
	|	ЗаявкаСтроки.ОсновноеСредство КАК ОсновноеСредство,
	|	ЗаявкаСтроки.НомерЗаявки КАК НомерЗаявки,
	|	ЕСТЬNULL(ЗаявкаЦены.Цена, ""-"") КАК Цена,
	|	ЕСТЬNULL(ЗаявкаЦены.Цена, 0) * ЕСТЬNULL(ЗаявкаЦены.Количество, ЗаявкаСтроки.Количество) КАК Сумма,
	|	ЕСТЬNULL(ЗаявкаЦены.Перечень, ЗаявкаСтроки.Перечень) КАК Перечень,
	|	&Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.ЗаявкаСтатусы.СрезПоследних КАК ЗаявкаСтатусы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкаСтроки КАК ЗаявкаСтроки
	|		ПО ЗаявкаСтатусы.ИдентификаторСтроки = ЗаявкаСтроки.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкаЦены.СрезПоследних КАК ЗаявкаЦены
	|		ПО ЗаявкаСтатусы.ИдентификаторСтроки = ЗаявкаЦены.ИдентификаторСтроки
	|ГДЕ
	|	(ЗаявкаСтатусы.Статус.Следующий.Согласование
	|			ИЛИ ЗаявкаСтатусы.Статус.Следующий1.Согласование
	|			ИЛИ ЗаявкаСтатусы.Статус.Следующий2.Согласование
	|			ИЛИ ЗаявкаСтатусы.Статус.Следующий3.Согласование)"
	);
	
	Запрос.УстановитьПараметр("Комментарий", ШаблонКомментария);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтрокиДляСогласования.Загрузить(РезультатЗапроса[0].Выгрузить());
	
	Если ТолькоЗаполнитьДляСогласования Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из РезультатЗапроса[1].Выгрузить() Цикл
		
		ЗаполнитьЗначенияСвойств(СтрокиДляСогласования.Добавить(), СтрокаТаблицы);
		
		РегистрыСведений.ЗаявкаСтатусы.УстановитьСледующийСтатус(СтрокаТаблицы.ИдентификаторСтроки, СтрокаТаблицы.Перечень);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНачатьОбработку(Команда)
	
	КомандаНачатьОбработкуНаСервере(Ложь);
	Элементы.СтрокиНеобработанные.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	Для Каждого СтрокаЗаявки Из СтрокиДляСогласования Цикл
		СтрокаЗаявки.Выбран = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	Для Каждого СтрокаЗаявки Из СтрокиДляСогласования Цикл
		СтрокаЗаявки.Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура КомандаСогласоватьНаСервере()
	
	ПараметрыОтбора = Новый Структура("Выбран", Истина);
	НайденныеСтроки = СтрокиДляСогласования.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаЗаявки Из НайденныеСтроки Цикл
		
		Запись = РегистрыСведений.ЗаявкаСогласованаЦена.СоздатьМенеджерЗаписи();
		Запись.Период              = ТекущаяДата();
		Запись.ИдентификаторСтроки = СтрокаЗаявки.ИдентификаторСтроки;
		Запись.СогласованаЦена     = Истина;
		Запись.Комментарий         = СтрокаЗаявки.Комментарий;
		Запись.Ответственный       = ПараметрыСеанса.ТекущийПользователь;
		Запись.ИмяКомпьютера       = ИмяКомпьютера();
		
		Запись.Записать();
		
		РегистрыСведений.ЗаявкаСтатусы.УстановитьСледующийСтатус(СтрокаЗаявки.ИдентификаторСтроки, СтрокаЗаявки.Перечень);
		
		СтрокиДляСогласования.Удалить(СтрокаЗаявки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСогласовать(Команда)
	КомандаСогласоватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОтказатьНаСервере()
	
	ПараметрыОтбора = Новый Структура("Выбран", Истина);
	НайденныеСтроки = СтрокиДляСогласования.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаЗаявки Из НайденныеСтроки Цикл
		
		Запись = РегистрыСведений.ЗаявкаОтмененные.СоздатьМенеджерЗаписи();
		Запись.Период              = ТекущаяДата();
		Запись.ИдентификаторСтроки = СтрокаЗаявки.ИдентификаторСтроки;
		Запись.Комментарий         = СтрокаЗаявки.Комментарий;
		Запись.Ответственный       = ПараметрыСеанса.ТекущийПользователь;
		Запись.ИмяКомпьютера       = ИмяКомпьютера();
		
		Запись.Записать();
		
		РегистрыСведений.ЗаявкаСтатусы.УстановитьСтатус(СтрокаЗаявки.ИдентификаторСтроки, Справочники.СтатусыЗаявки.СтатусОтмена());
		
		СтрокиДляСогласования.Удалить(СтрокаЗаявки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтказать(Команда)
	КомандаОтказатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВернутьВОжиданиеНаСервере()
	
	ПараметрыОтбора = Новый Структура("Выбран", Истина);
	НайденныеСтроки = СтрокиДляСогласования.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаЗаявки Из НайденныеСтроки Цикл
		
		РегистрыСведений.ЗаявкаСтатусы.УстановитьПредыдущийСтатус(СтрокаЗаявки.ИдентификаторСтроки);
		
		СтрокиДляСогласования.Удалить(СтрокаЗаявки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВернутьВОжидание(Команда)
	
	КомандаВернутьВОжиданиеНаСервере();
	Элементы.СтрокиНеобработанные.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПользователя() Экспорт
	
	ПоказатьОповещениеПользователя("КУПОЛ", "Бла-бла-бла", "Есть заявки требующие внимания", БиблиотекаКартинок.НапоминаниеРО, СтатусОповещенияПользователя.Важное);
	
КонецПроцедуры
